#include<stdio.h>
#include<stdlib.h>
#include<string.h>


// for qsort
/*
int compare(int *t, int *s) {
    return *t - *s;
}
*/

long long int pre[] = {
    1LL,
    4LL,
    9LL,
    121LL,
    484LL,
    10201LL,
    12321LL,
    14641LL,
    40804LL,
    44944LL,
    1002001LL,
    1234321LL,
    4008004LL,
    100020001LL,
    102030201LL,
    104060401LL,
    121242121LL,
    123454321LL,
    125686521LL,
    400080004LL,
    404090404LL,
    10000200001LL,
    10221412201LL,
    12102420121LL,
    12345654321LL,
    40000800004LL,
    1000002000001LL,
    1002003002001LL,
    1004006004001LL,
    1020304030201LL,
    1022325232201LL,
    1024348434201LL,
    1210024200121LL,
    1212225222121LL,
    1214428244121LL,
    1232346432321LL,
    1234567654321LL,
    4000008000004LL,
    4004009004004LL,
    100000020000001LL,
    100220141022001LL,
    102012040210201LL,
    102234363432201LL,
    121000242000121LL,
    121242363242121LL,
    123212464212321LL,
    123456787654321LL,
    400000080000004LL,
    10000000200000001LL,
    10002000300020001LL,
    10004000600040001LL,
    10020210401202001LL,
    10022212521222001LL,
    10024214841242001LL,
    10201020402010201LL,
    10203040504030201LL,
    10205060806050201LL,
    10221432623412201LL,
    10223454745432201LL,
    12100002420000121LL,
    12102202520220121LL,
    12104402820440121LL,
    12122232623222121LL,
    12124434743442121LL,
    12321024642012321LL,
    12323244744232321LL,
    12343456865434321LL,
    12345678987654321LL,
    40000000800000004LL,
    40004000900040004LL
};

int binsearch(long long int n) {
    int r = sizeof(pre)/sizeof(long long int);
    int l = 0;
    int m;
    long long int t;
    while(l!=r) {
        m = (r+l)/2; // overflow?ãNÇ±ÇÈÇÌÇØÇ»Ç¢Ç≈Ç∑Ç™Ç»ÅB
        t = pre[m];
        if(t < n) {
            l = m+1;
        }
        else if(t > n) {
            r = m;
        }
        else {
            l = r = m;
        }
    }
}


int main(void) {
    int num;
    int i;
    long long int A, B;
    int a, b;

    scanf("%d", &num);
    for(i = 1; i <= num; ++i) {
        scanf("%lld %lld", &A, &B);
        a = binsearch(A);
        b = binsearch(B);
        if(B == pre[b]) ++b;

        printf("Case #%d: %d\n", i, b-a);
    }

    return 0;
}
